Product - Income Tax/sample messages/file_request_ir44_standalone.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <r44:fileRequest xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2" 
                        xmlns:r44="urn:www.ird.govt.nz/GWS:types/ReturnIR44.v1">
                        <rc:fileHeader xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">052120330</cmn:identifier>
                            <cmn:accountType>INC</cmn:accountType>
                            <rc:periodEndDate>2019-03-31</rc:periodEndDate>
                            <rc:majorFormType>INC</rc:majorFormType>
                            <rc:minorFormType>44</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>false</rc:isAmended>
                                    <rc:amendReason/>
                                    <rc:amendDetails/>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r44:FormFieldsType" 
                                xmlns:ic="urn:www.ird.govt.nz/GWS:types/IncomeReturnCommon.v1" 
                                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                                <r44:financialMarketsAuthorityNumber>AS/3980</r44:financialMarketsAuthorityNumber>
                                <r44:fundBalanceDate>2019-03-31</r44:fundBalanceDate>
                                <r44:assetsIncludeNZLifeOrTransferred>false</r44:assetsIncludeNZLifeOrTransferred>
                                <r44:nzLifeOrTransfersTotalAssets>false</r44:nzLifeOrTransfersTotalAssets>
                                <r44:electionRequired>false</r44:electionRequired>
                                <r44:fundIncome>1000.00</r44:fundIncome>
                                <r44:deductionsFromOtherSchemes>
                                    <ic:deduction>
                                        <ic:name>Johnny Bravo</ic:name>
                                        <ic:irdNumber>074407102</ic:irdNumber>
                                        <ic:amount>1000.00</ic:amount>
                                    </ic:deduction>
                                </r44:deductionsFromOtherSchemes>
                                <r44:totalDeductionsFromOtherSchemes>1000.00</r44:totalDeductionsFromOtherSchemes>
                                <r44:deductionsTreatedAsCapitalOnDisposal>0</r44:deductionsTreatedAsCapitalOnDisposal>
                                <r44:deductionsTreatedAsRevenueOnDisposal>0</r44:deductionsTreatedAsRevenueOnDisposal>
                                <r44:deductionsToOtherSchemes>
                                    <ic:deduction>
                                        <ic:name>Homer Simpson</ic:name>
                                        <ic:irdNumber>081734402</ic:irdNumber>
                                        <ic:amount>1000.00</ic:amount>
                                    </ic:deduction>
                                </r44:deductionsToOtherSchemes>
                                <r44:totalDeductionsToOtherSchemes>1000</r44:totalDeductionsToOtherSchemes>
                                <r44:additionsTreatedAsCapitalOnDisposal>0</r44:additionsTreatedAsCapitalOnDisposal>
                                <r44:additionsTreatedAsRevenueOnDisposal>0</r44:additionsTreatedAsRevenueOnDisposal>
                                <r44:lossesBroughtForward>0</r44:lossesBroughtForward>
                                <r44:totalTaxableIncome>1000.00</r44:totalTaxableIncome>
                                <r44:taxOnTaxableIncome>280.00</r44:taxOnTaxableIncome>
                                <r44:trusteeDetails>
                                    <ic:trustee>
                                        <ic:fullName>BoJack Horseman</ic:fullName>
                                        <ic:irdNumber>093612547</ic:irdNumber>
                                    </ic:trustee>
                                </r44:trusteeDetails>
                                <r44:fifOrCFCDisclosureRequired>false</r44:fifOrCFCDisclosureRequired>
                                <r44:investmentsDisposedOfDuringYear>false</r44:investmentsDisposedOfDuringYear>
                                <r44:investmentsDisposedOfDuringYearAmount>1000.00</r44:investmentsDisposedOfDuringYearAmount>
                                <r44:gainsOrLossesTreatedAsNonTaxable>false</r44:gainsOrLossesTreatedAsNonTaxable>
                                <r44:gainsOrLossesTreatedAsNonTaxableReason>string</r44:gainsOrLossesTreatedAsNonTaxableReason>
                                <r44:preApril1988InvestmentsDisposedOf>false</r44:preApril1988InvestmentsDisposedOf>
                                <r44:investmentsTreatedAsTradingStock>false</r44:investmentsTreatedAsTradingStock>
                                <r44:overseasTaxCredit>1000.00</r44:overseasTaxCredit>
                                <r44:imputationCredits>1000.00</r44:imputationCredits>
                                <r44:rwtAndOtherTaxCredits>1000.00</r44:rwtAndOtherTaxCredits>
                                <r44:rlwtCredit>0</r44:rlwtCredit>
                                <r44:residualIncomeTax>-1000.00</r44:residualIncomeTax>
                                <r44:overpaymentProvisionalTax>1000.00</r44:overpaymentProvisionalTax>
                                <r44:provisionalTax>
                                    <ic:provisionalTaxOption>STD</ic:provisionalTaxOption>
                                    <ic:provisionalTaxPayable>1000</ic:provisionalTaxPayable>
                                    <ic:provisionalTaxStartDate>2018-08-01</ic:provisionalTaxStartDate>
                                </r44:provisionalTax>
                            </rc:formFields>
                        </rc:fileBody>
                    </r44:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>